// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// 2017-01-03
// 11:32:07
// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#include   "App.h"


/*-----------------------------------------------------------------------------------------------------
 
 \param void 
 
 \return uint32_t 
-----------------------------------------------------------------------------------------------------*/
uint32_t U3HB01_get_hall_state(void)
{
  uint32_t val = 0;
  uint32_t reg;
  reg = PTB_BASE_PTR->PDIR;
  if (reg & BIT(18)) val |= BIT(2);  // Сигнал ENCA. Yellow в жгуте мотора DS-42RPBL42600246000-49K
  if (reg & BIT(19)) val |= BIT(1);  // Сигнал ENCB. Green  в жгуте мотора DS-42RPBL42600246000-49K
  if (reg & BIT(1))  val |= BIT(0);  // Сигнал ENCC. Blue   в жгуте мотора DS-42RPBL42600246000-49K

  hall_inputs = val;
  return val;
}


