// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// 2016.07.05
// 09:27:50
// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#include   "App.h"

#define FLAG_ADC_DONE               BIT( 0 ) // Флаг собьтия окончания цикла измерений многоканального АЦП
#define FLAG_INPUTS_CHANGED         BIT( 1 ) // Флаг события изменения состояния входов

extern void FMSTR_Recorder(void);

LWEVENT_STRUCT inputs_lwev;

/*------------------------------------------------------------------------------


 ------------------------------------------------------------------------------*/
void Inputs_create_sync_obj(void)
{
  // Создаем объект синхронизации
  _lwevent_create(&inputs_lwev, LWEVENT_AUTO_CLEAR);
}

/*------------------------------------------------------------------------------


 ------------------------------------------------------------------------------*/
void Inputs_set_ADC_evt(void)
{
  _lwevent_set(&inputs_lwev, FLAG_ADC_DONE);
}

/*------------------------------------------------------------------------------


 ------------------------------------------------------------------------------*/
_mqx_uint Inputs_wait_for_ADC_event(void)
{
  return _lwevent_wait_for(&inputs_lwev, FLAG_ADC_DONE, TRUE, NULL);
}

/*------------------------------------------------------------------------------


 ------------------------------------------------------------------------------*/
_mqx_uint Inputs_wait_for_changed_event(uint32_t ticks)
{
  return _lwevent_wait_ticks(&inputs_lwev, FLAG_INPUTS_CHANGED, TRUE, ticks);
}




